# Fix Incomplete Data

In [2]:
import pandas as pd
import numpy as np

In [3]:
data = {'A':[1,2,3], 'B':[4,np.nan,6],'C':[7,np.nan,9],'D':[10,11,12]}
my_df = pd.DataFrame(data)
my_df

   A    B    C   D
0  1  4.0  7.0  10
1  2  NaN  NaN  11
2  3  6.0  9.0  12

In [4]:
my_df.dropna()

   A    B    C   D
0  1  4.0  7.0  10
2  3  6.0  9.0  12

In [5]:
my_df.dropna(axis=1)

   A   D
0  1  10
1  2  11
2  3  12

In [6]:
my_df.dropna(thresh=1,axis=1)

   A    B    C   D
0  1  4.0  7.0  10
1  2  NaN  NaN  11
2  3  6.0  9.0  12

In [7]:
my_df.dropna(thresh=2,axis=1)

   A    B    C   D
0  1  4.0  7.0  10
1  2  NaN  NaN  11
2  3  6.0  9.0  12

In [8]:
my_df.fillna(value=1)

   A    B    C   D
0  1  4.0  7.0  10
1  2  1.0  1.0  11
2  3  6.0  9.0  12

In [10]:
my_df.fillna(value=my_df['B'].mean())

   A    B    C   D
0  1  4.0  7.0  10
1  2  5.0  5.0  11
2  3  6.0  9.0  12

In [11]:
my_df.fillna(value=my_df['B'].min())

   A    B    C   D
0  1  4.0  7.0  10
1  2  4.0  4.0  11
2  3  6.0  9.0  12

In [12]:
my_df.fillna(value=my_df['B'].max())

   A    B    C   D
0  1  4.0  7.0  10
1  2  6.0  6.0  11
2  3  6.0  9.0  12

In [14]:
my_df['B'].fillna(value=my_df['B'].sum())

0     4.0
1    10.0
2     6.0
Name: B, dtype: float64